In [1]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass  Gender   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [3]:
inputs = df.drop("Survived",axis="columns")
target = df.Survived

In [4]:
dummies = pd.get_dummies(inputs.Gender)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [5]:
inputs = pd.concat([inputs,dummies],axis="columns")
inputs.head(3)

   Pclass  Gender   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [6]:
inputs.drop(["Gender","male"],axis="columns",inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [7]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [73]:
inputs.Age[:100]

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
      ...
95     NaN
96    71.0
97    23.0
98    34.0
99    34.0
Name: Age, Length: 100, dtype: float64

In [74]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [75]:
from sklearn.model_selection import train_test_split
X_train,X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [76]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [77]:
model.fit(X_train,y_train)

GaussianNB()

In [78]:
model.score(X_test,y_test)

0.8134328358208955

In [79]:
X_test[0:10]

     Pclass        Age      Fare  female
863       3  29.699118   69.5500       1
91        3  20.000000    7.8542       0
544       1  50.000000  106.4250       0
322       2  30.000000   12.3500       1
211       2  35.000000   21.0000       1
422       3  29.000000    7.8750       0
105       3  28.000000    7.8958       0
522       3  29.699118    7.2250       0
526       2  50.000000   10.5000       1
409       3  29.699118   25.4667       1

In [80]:
y_test[0:10]

863    0
91     0
544    0
322    1
211    1
422    0
105    0
522    0
526    1
409    0
Name: Survived, dtype: int64

In [81]:
model.predict(X_test[:10])

array([1, 0, 1, 1, 1, 0, 0, 0, 1, 1], dtype=int64)